{
    "mainjson":[
        {
            "id":2, 
            "titleUp":"당일 UP 유료강의 후기",
            "imgUp": "./img/codeit2.png",
            "data": "2023-12-28",
            "title":"코드잇 후기1",
            "contentUp":"코드잇 수강 후기  - 실무 중심의 실력 강화 코드잇 수강 후기  - 실무 중심의 실력 강화",
            "content":"후기 및 리뷰입니다.",
            "url": "http://www.codeit.kr",
            "contentDowon":"빙고 포맷의 인터랙티브 콘텐츠로, 본인의 MBTI에 해당하는 빙고판과 성격유형이 마스킹 된 미스테리 빙고판을 통해 자신의 ‘진짜’ MBTI를 알아보는 웹 애플리케이션입니다. 잘못 분류되기 쉬운 성격유형간 데이터를 기반으로, 자신의 MBTI와 mistype에 해당되는 빙고의 선택 개수를 비교하여 일치도가 가장 높은 성격유형을 찾아주는 형식입니다. ‘미스테리 빙고’를 통해 본인이 생각지 못했던 성격유형이 가장 높은 순위로 나오는 경우와, 간단한 빙고를 통해서도 본인의 MBTI가 확인되는 경우 모두 재미를 느낀다는 점이 매력 포인트입니다.친구들과 각자의 MBTI 빙고 이미지를 찾아 동그라미 표시를 해 서로에게 공유하며 놀다가 이런 복잡한 과정이 필요 없는 인터랙티브한 MBTI 빙고를 만들어 보면 어떨까 하는 생각에서 시작한 아이디어입니다. 단순히 본인의 MBTI를 알아보는 것은 식상하게 느껴질 수 있을 것 같아, 일반적인 성격유형 서비스와는 역으로 처음에 본인의 MBTI를 입력한 후에 실제로 해당 성격유형과 어느 정도 일치하는지를 보여주는 방식을 택하고 ‘미스테리 빙고’와 같은 재미 요소를 추가했습니다. 많은 사람이 사용하는 프로젝트가 되었으면 좋겠다는 생각에 MBTI 라는 주제를 택한 점도 있습니다. SNS로 바이럴하게 퍼질 수 있도록 기획·디자인하고 개발했는데, 실제로 배포 첫날 350명이 넘게 이용하고 현재까지 7만 명이 넘는 유저와 44만 뷰 이상의 조회수를 기록했습니다. 리액트를 배우고 처음 만든 프로젝트였는데 제게 많은 동기부여가 되었고, 웹 개발과 디지털 프로덕트의 매력을 확실하게 느끼는 계기였습니다.모바일 기준으로 디자인 및 개발, 회원가입이 전환율을 떨어뜨릴 거라 판단하여, 브라우저 기반 uid 생성 및 local storage에 보관하여 사용자를 특정하는 방법을 선택, React Router와 Context를 통해 페이지 간 상태를 관리", 
            "suggestion": 1
        },
        {
            "id":3, 
            "titleUp":"당일 UP 유료강의 후기",
            "imgUp":"./img/codeit33.png",
            "data": "2023-12-28",
            "title":"코드잇 후기2",

            "contentUp":"코드잇 수강 후기  - 실무 중심의 실력 강화 코드잇 수강 후기  - 실무 중심의 실력 강화",
            "content":"후기 및 리뷰입니다.",
            "url": "http://www.codeit.kr",
            "contentDowon":"영상 하나에 다양한 노래를 조합한 플레이리스트 형태의 유튜브 영상(보통 플리라고 부르는)에서, 영상 내의 노래들을 셔플할 수 있고 재생 제어할 수 있는 플레이어를 제공합니다. 셔플하길 원하는 플레이리스트 영상의 주소를 간단히 수정하기만 하면 이용할 수 있습니다. youtube 라는 부분만 youtubesf로 바꿔주세요. sf는 shuffle의 약자입니다. 주요 기능 유튜브 영상 설명 또는 댓글의 타임라인으로 재생목록 생성곡 목록 셔플재생, 일시정지, 이전곡, 다음곡, 볼륨 조절 등 재생 제어현재 재생 곡 확인", 
            "suggestion": 0
        },
        {
            "id":4, 
            "titleUp":"당일 UP 유료강의 후기",
            "imgUp":"./img/codingapple.png",
            "data": "2023-12-28",
            "title":"코딩애플 후기3",

            "contentUp":"코딩애플 수강 후기  - 실무 중심의 실력 강화 코드잇 수강 후기  - 실무 중심의 실력 강화",
            "content":"후기 및 리뷰입니다.",
            "url": "https://codingapple.com/",
            "contentDowon":"별점을 다섯개를 안 줄 수가 없는 명강의 통계학과 컴공 졸업하고 3개월간 AI 공부하면서 가장 명확하고 많이 배운 시간이었습니다. 후속 강의 안 만들어 주시면 별점테러 할거에요,, 돈은 이미 준비되어 있습니다 센세,,  최고의 강의진심으로 node.js 강의로만 100만원 넘게 썻으나 결국 포기했었습니다. 국비수업 들으면서 코딩애플 javascript 강의를 처음 접했었고 그때 만들었던 쇼핑몰로 포트폴리오도 만들어서 6개월 전에 취업했었습니다. 프론트엔드 모든 강의 중 가장 최고의 강의, 최고의 강좌라고 감히 말할 수 있습니다.이 강의를 듣고 이제 모든 개발교육은 코딩애플로 결정 리액트 배우려고 타사 온라인 강의 몇십만원들여서 사서 들어봤지만, 코딩애플 교육이 ㄹㅇ최고임. 다른거 듣지마세요. 진짜 쉽게 잘 가르쳐주십니다. 앞으로도 개발교육은 코딩애플에서만 들을거임. ",
            "suggestion": 0
        },
        {
            "id":5, 
            "titleUp":"당일 UP 간단한 it지식",
            "imgUp":"./img/itledge2.png",
            "data": "2023-12-27",
            "title":"간단한 it지식 후기1",

            "contentUp":"간단한 it지식 후기1 - 실무 중심의 실력 강화 간단한 it지식 후기 IT 업계에 종사한다면 필독도서 :)",
            "content":"후기 및 리뷰입니다.",
            "url": "https://book.interpark.com/product/BookDisplay.do?_method=detail&sc.saNo=001&sc.prdNo=334577574",
            "contentDowon":"IT 시대의 필수 교양서 우리는 매일 스마트폰으로 메시지를 보내고, 컴퓨터로 일을 합니다. 또 음식점에서 키오스크로 주문하고, 가상현실에서 게임을 즐깁니다. IT는 더 이상 전문가들만의 이야기가 아닙니다. 우리의 삶 곳곳을 IT가 점령하고 있고, 그 속도는 계속해서 빨라지고 있습니다. 이제 IT를 모르고선 세상을 이해하기 어려운 시대가 되었습니다.이 책은 비전공자를 위한 ‘IT 기초 문법서’로, 한 번쯤 들어봤을 프로그래밍 언어, 운영체제, 네트워크, API, JSON, 데이터베이스, 이미지 처리, 프레임워크, 라이브러리, 깃(Git), 디자인 이슈 등 다양한 지식을 담고 있습니다. 복잡하게 얽혀 있어 한 번에 이해하기 어려웠던 각각의 지식들을 친숙한 이야기로 쉽게 풀어냄으로써 IT 산업의 전체적인 큰 그림을 그릴 수 있도록 도와줍니다.", 
            "suggestion": 1
        },
        {
            "id":6, 
            "titleUp":"당일 UP 간단한 it지식",
            "imgUp":"./img/itledge3.png",
            "data": "2023-12-27",
            "title":"간단한 it지식 후기2",

            "contentUp":"간단한 it지식 후기2 - 실무 중심의 실력 강화 간단한 it지식 후기 IT 업계에 종사한다면 필독도서 :)",
            "content":"후기 및 리뷰입니다.",
            "url": "https://book.interpark.com/product/BookDisplay.do?_method=Detail&sc.shopNo=0000400000&dispNo=&sc.prdNo=356723484&sc.saNo=002001023001",
            "contentDowon":"ChatGPT로 기획하고 분석하고 보고하는 당신이 일잘러! 일잘러는 ChatGPT로 기획합니다 ChatGPT로 문제를 파악하고 시장을 조사해서 정리할 수 있습니다. 신제품 아이디어를 도출하고 전략을 수립할 수 있습니다. 일잘러는 ChatGPT로 분석합니다 ChatGPT로 데이터를 분석하고 통찰과 시사점을 얻을 수 있습니다. 실적과 성과를 분석하고 목표를 관리할 수 있습니다. 일잘러는 ChatGPT로 보고합니다", 
            "suggestion": 0
        },
        {
            "id":7, 
            "titleUp":"당일 UP 간단한 it지식",
            "imgUp":"./img/itledge4.png",
            "data": "2023-12-27",
            "title":"간단한 it지식 후기3",

            "contentUp":"간단한 it지식 후기3 - 실무 중심의 실력 강화 간단한 it지식 후기 IT 업계에 종사한다면 필독도서 :)",
            "content":"후기 및 리뷰입니다.",
            "url": "https://product.kyobobook.co.kr/detail/S000001981866",
            "contentDowon":"IT 시대의 필수 교양서 우리는 매일 스마트폰으로 메시지를 보내고, 컴퓨터로 일을 합니다. 또 음식점에서 키오스크로 주문하고, 가상현실에서 게임을 즐깁니다. IT는 더 이상 전문가들만의 이야기가 아닙니다. 우리의 삶 곳곳을 IT가 점령하고 있고, 그 속도는 계속해서 빨라지고 있습니다. 이제 IT를 모르고선 세상을 이해하기 어려운 시대가 되었습니다. 이 책은 비전공자를 위한 ‘IT 기초 문법서’로, 한 번쯤 들어봤을 프로그래밍 언어, 운영체제, 네트워크, API, JSON, 데이터베이스, 이미지 처리, 프레임워크, 라이브러리, 깃(Git), 디자인 이슈 등 다양한 지식을 담고 있습니다. 복잡하게 얽혀 있어 한 번에 이해하기 어려웠던 각각의 지식들을 친숙한 이야기로 쉽게 풀어냄으로써 IT 산업의 전체적인 큰 그림을 그릴 수 있도록 도와줍니다.",
            "suggestion": 0
        },
        {
            "id":8, 
            "titleUp":"당일 UP 컴퓨터 살 때",
            "imgUp": "./img/computer2.png",
            "data": "2023-12-27",
            "title":"컴퓨터 살 때 후기1",

            "contentUp":"컴퓨터 살 때 후기  - 실무 중심의 실력 강화 컴퓨터 살 때 후기  - 실무 중심의 실력 강화",
            "content":"후기 및 리뷰입니다.",
            "url": "https://item.gmarket.co.kr/Item?goodscode=3060487844&GoodsSale=Y&jaehuid=200013954",
            "contentDowon":"Dell Inspiron 14 5000 - 사무용 노트북 -**구매 동기:**Dell Inspiron 14 5000을 선택한 이유는 탁월한 성능과 가벼운 디자인 때문입니다. 사무실에서의 업무 이동이 많은데, 가벼운 무게와 휴대성이 큰 장점이었습니다. **성능 및 속도:**인텔 Core i5 프로세서와 8GB RAM은 다양한 업무 작업을 빠르게 처리할 수 있게 해줍니다. 멀티태스킹에도 문제가 없어 업무 효율성이 크게 향상되었습니다.### **디자인과 편의성:**금속 마감과 터치스크린이 있는 14인치 디스플레이는 눈에 띄게 고급스럽고 작업 환경을 향상시켰습니다. 키보드도 편안하게 타이핑할 수 있어 장시간의 작업도 피로하지 않았습니다. ### **종합 평가:**- Dell Inspiron 14 5000은 사무용으로 적합한 뛰어난 노트북입니다. 성능, 디자인, 이동성 등 여러 측면에서 만족스러웠고, 비용 대비 가성비가 높다고 생각합니다. **참고사항:** 구매 전에 자신의 용도와 선호도에 따라 다양한 제품을 비교해보고, 실제 사용자들의 후기와 의견을 살펴보는 것이 좋습니다.", 
            "suggestion": 1
        },
        {
            "id":9, 
            "titleUp":"당일 UP 컴퓨터 살 때",
            "imgUp":"./img/computer33.png",
            "data": "2023-12-27",
            "title":"컴퓨터 살 때 후기2",

            "contentUp":"컴퓨터 살 때 후기  - 실무 중심의 실력 강화 컴퓨터 살 때 후기  - 실무 중심의 실력 강화",
            "content":"후기 및 리뷰입니다.",
            "url": "https://prod.danawa.com/info/?pcode=18917870",
            "contentDowon":"삼성전자 갤럭시북3 프로 NT960XFG-KC51G, **노트북/운영체제(OS)** : 윈도우11홈, **화면정보** : 40.6cm(16인치)/2880x1800(WQXGA+)/400nit/주사율 : 120Hz, **CPU** : 인텔 / 코어i5-13세대/ i5-1340P (1.9GHz) / 12코어(4p+8E), **램** : LPDDR5(온보드)/램 용량 : 16GB /램 교체 :불가능/ **그래픽** : 내장그래픽 /lris Xe, **저장장치**: M.2(NVMe)/256GB / 저장 슬롯 : 2개, **네티워크** : 무선랜: 802.11ax(Wi-Fi 6E), **관련기사** 그램이 놀라고 맥북도 경악한, 갤럭시 북3 폼 미쳤다! 등록월 2023.02", 
            "suggestion": 0
        },
        {
            "id":10, 
            "titleUp":"당일 UP 컴퓨터 살 때",
            "imgUp":"./img/computer4.png",
            "data": "2023-12-27",
            "title":"컴퓨터 살 때 후기3",

            "contentUp":"컴퓨터 살 때 후기  - 실무 중심의 실력 강화 컴퓨터 살 때 후기  - 실무 중심의 실력 강화",
            "content":"후기 및 리뷰입니다.",
            "url": "https://blog.naver.com/PostView.naver?blogId=b200700&logNo=223278296317&categoryNo=21&parentCategoryNo=&from=thumbnailList",
            "contentDowon":"**다나와에 각 부품 후기있음**작업용 블랙깔끔한 성능위주 데스크탑 - CPU : 인텔 i7-14700K 컴퓨터의 두뇌 559,280원 중앙 처리 장치 또는 CPU(영어: central processing unit, central/main processor)는 컴퓨터 시스템을 통제하고 프로그램의 연산을 실행 · 처리하는 가장 핵심적인 컴퓨터의 제어 장치, 혹은 그 기능을 내장한 칩이다. 메인보드 각 부품의 연결체 : GA Z790 어로스 엘리트  GIGABYTE Z790 AORUS ELITE 353,060원 컴퓨터, 비디오 게임 콘솔, 엘리베이터와 같은 확장 가능한 전자기기에 쓰이는 필수 주요 부품의 일종으로, 각종 케이블이나 배선을 통합하여 연결하는 회로와 입출력 포트가 설치되어 있는 전자기판이다. 메모리 다중 작업을 위해: 삼성 DDR5 32G 5600 *2EA 삼성전자 DDR5-5600 (32GB) 111,780원 메모리는 현재 실행되는 프로그램의 명령어와 데이터를 저장하는 부품입니다. 즉, 프로그램이 실행되려면 반드시 메모리에 저장되어 있어야 합니다. 이때 컴퓨터가 빠르게 작동하기 위해서는 메모리 속 명령어와 데이터가 중구난방으로 저장되어 있으면 안 됩니다. 저장공간 : SK 하이닉스 P41 1TB  159,500원 그래픽카드 : GA RTX 4070 12G 826,620원 CPU의 명령하에 이루어지는 그래픽 작업을 전문적으로 빠르게 처리하고 디지털 신호를 영상 신호로 바꿔 모니터로 전송하는 장치이다. 파워 PC의 심장: M/C 클래식 골드 750W 134,000원 PC를 사용하면 일정한 전격을 유지하며 출력을 해야 하는 부품들이 있습니다. 장시간 PC를 켜둔 상태로 두면 전압이 낮아지는 문제도 발생하는데, 이로 인해 고성능 PC에는 높은 전격의 파워가 PC 구동을 유지해 줄 수 있도록 해줍니다. 쿨러 : NZXT 크라켄 360 268,990원 CPU의 방열면적을 넓혀주는 CPU 쿨러를 사용하게 된다. CPU의 집적도와 발열량이 모두 높아진 현대 컴퓨터에는 필수적인 장치이다.케이스 : 프랙탈디자인 메쉬파이 208,970원",
            "suggestion": 0
        }
    ],

    "login": { "id":"test", "pw":"1234" }
    

    
}